{
  "financeGeneral": {
    "sip": "A Systematic Investment Plan (SIP) is a way to invest a fixed amount of money in mutual funds at regular intervals. It helps in rupee cost averaging and disciplined investing.",
    "ppf": "Public Provident Fund (PPF) is a long-term savings scheme backed by the Indian government. It offers a fixed, tax-free return and is a safe investment option.",
    "fd": "A Fixed Deposit (FD) is a financial instrument provided by banks which provides investors with a higher rate of interest than a regular savings account, until the given maturity date.",
    "emergency fund": "An emergency fund is money set aside to cover unexpected financial surprises, like a job loss or medical emergency. It's recommended to have 3-6 months of living expenses saved.",
    "credit score": "A credit score (like CIBIL) is a 3-digit number that represents your creditworthiness. A higher score makes it easier to get loans and credit cards at better interest rates.",
    "debt snowball": "The debt snowball method is a debt-reduction strategy where you pay off debts from smallest to largest, regardless of interest rate. The psychological win of clearing a debt provides momentum.",
    "debt avalanche": "The debt avalanche method is a debt-reduction strategy where you pay off debts with the highest interest rates first. This method saves you the most money in interest over time.",
    "mutual fund": "A mutual fund is a pool of money collected from many investors to invest in stocks, bonds, or other assets. They are managed by professional fund managers.",
    "nps": "The National Pension System (NPS) is a voluntary retirement savings scheme that allows subscribers to make defined contributions towards planned retirement.",
    "elss": "Equity Linked Savings Scheme (ELSS) is a type of mutual fund that helps you save taxes under Section 80C and also provides an opportunity for long-term capital appreciation.",
    "etf": "An Exchange-Traded Fund (ETF) is a type of investment fund and exchange-traded product. They are traded on stock exchanges, much like stocks.",
    "index fund": "An index fund is a type of mutual fund or ETF with a portfolio constructed to match or track the components of a financial market index, such as the NIFTY 50. It offers broad market exposure and typically has low fees.",
    "tax": "In India, income tax is levied on individuals based on their income slabs. You can save tax through various deductions under sections like 80C (PPF, ELSS, etc.), 80D (health insurance), and HRA (House Rent Allowance)."
  },
  "howToApp": {
    "edit transaction": "To edit a transaction, go to the 'Home' or 'Transactions' screen and simply tap on the transaction you wish to change. The edit screen will pop up.",
    "delete transaction": "To delete a transaction, go to the 'Home' or 'Transactions' screen. Long-press on a transaction to enter bulk-edit mode, select the ones you want to delete, and tap the trash icon.",
    "link transaction": "When you add or edit a transaction, you'll see a 'Link to Goal' dropdown. You can select any of your active goals from there to link the expense.",
    "set a goal": "Go to the 'Goals' screen, select the 'Goals' tab, and tap the floating plus button to add a new goal. You'll be able to set a title, target amount, and an optional deadline.",
    "export csv": "You can export all your transaction data to a CSV file from the 'Settings' page under the Data Management section. You can also export from the 'Transactions' screen.",
    "import csv": "You can import transactions from a CSV file. Go to 'Settings', then 'Data Management', and tap 'Import Data from CSV'. Follow the on-screen instructions for the correct file format.",
    "generate report": "To get a printable report, go to the 'Insights' screen, select your desired time period, and tap the 'Generate Report' button at the top.",
    "search": "Tap the search icon in the top-right corner of the app to search for transactions, goals, and budgets all at once.",
    "delete data": "Be careful! You can delete all your app data from the 'Settings' page in the 'Danger Zone'. This action cannot be undone.",
    "change theme": "You can switch between light and dark themes in the 'Settings' page under the 'Appearance' section."
  },
  "appAbout": {
    "sentimint": "Sentimint is your personal finance tracker. It helps you understand the emotions behind your spending to build healthier financial habits. For smart features, I use Google's AI, but your core financial data always stays private on your device."
  },
  "savingTips": {
    "general": [
      "Track your spending for a month to see where your money goes.",
      "Create a budget and stick to it. The 50/30/20 rule is a great start (50% Needs, 30% Wants, 20% Savings).",
      "Automate your savings. Set up a recurring transfer to your savings account right after you get paid.",
      "Review your subscriptions. Cancel any you don't use regularly.",
      "Try the '30-day rule' for non-essential purchases. If you still want it after 30 days, consider buying it.",
      "Plan your meals for the week to avoid impulsive food orders and reduce grocery waste.",
      "Unsubscribe from marketing emails to reduce the temptation of sales and promotions."
    ]
  }
}
